Revit 2024 API
TableSectionData.GetTableCellStyle Method
 Returns a cell's style and if no style exists for this cell, it would come from the column, or the section
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public TableCellStyle GetTableCellStyle(
	int nRow,
	int nCol
)
Visual Basic
Public Function GetTableCellStyle ( _
	nRow As Integer, _
	nCol As Integer _
) As TableCellStyle
Visual C++
public:
TableCellStyle^ GetTableCellStyle(
	int nRow,
	int nCol
)
Parameters
nRow
Type: System.Int32
nCol
Type: System.Int32
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given row number nRow is invalid. -or- The given column number nCol is invalid.
See Also
TableSectionData Class
Autodesk.Revit.DB Namespace